jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
/*
GPIO 16		 D0 - WAKE, USER button, connect to RST to wake up after sleep
GPIO 5		 D1 - I2C_SCL
GPIO 4		~D2 - I2C_SDA
GPIO 0		 D3 - pullup for FLASH boot, pulldown for UART boot, TM1637_CLK
GPIO 2		 D4 - pullup, Serial1_TX, TM1637_DIO
GPIO 14		~D5 - SoftUART_TX
GPIO 12		~D6 - SoftUART_RX
GPIO 13		 D7 -
GPIO 15		~D8 - pulldown
GPIO 13		 A7 - analog in
*/

/* Untested feature:
 - SCHEDULE service
 - generalize index ranges (start all from 0)
 - generalize switches behavior (accept on/off as bool and 0..1023 for pwm)
 - save pwm outputs values at EEPROM
 - restore flag reset if PushingBox/E-Mail not sent
 - event action:
	 conditions:
		 input?=on,off,x,c
		 output?=on,off,x,c
		 counter>x
		 temperature<>x
		 humidity<>x
		 co2<>x
	 actions:
		 send_mail=address;message
		 send_GScript
		 save_log;
*/

/*
Planned features:
 - EVENT service - option to check action successful execution.
 - SCHEDULE service - restore flags at the start of the day or set the appropriate time region to activate schedule event.
 - GoogleScript service - memory allocation problem
 - DEBUG mode verbose serial output
 - reduce RAM usage (unnecessary String)
 - ? input mode setup (pullup/down)
 - ? efficient sleep till next event planned with network connectivity restoration after wake up and parameter / timers restore to fire.
 - compile time pin arrangement control
*/


/*
Sensors to be supported:
 - BME280 (I2C)
 - ACS712 (A0)
 - GPRS module via UART/SoftUART(TX_pin, RX_pin, baud_rate); send SMS, make call
*/

#include <ESP8266WiFi.h>
#include <EEPROM.h>
#include <TimeLib.h>
#include "configuration.h"
#include "datastructures.h"

#define SWITCH_ON_NUMBER F("1")
#define SWITCH_OFF_NUMBER F("0")
#define SWITCH_ON F("on")
#define SWITCH_OFF F("off")
#define eol F("\r\n")
#define divider F(";")
#define quote F("\"")

// WiFi settings
#define MAX_SRV_CLIENTS 5 //how many clients should be able to telnet to this ESP8266
#define RECONNECT_TIME 5000 //time for connection await
String ssid = "";
String wiFiPassword = "";
unsigned int telnetPort = 23;
String netInput[MAX_SRV_CLIENTS];
byte wiFiIntendedStatus = WIFI_STOP;
WiFiServer telnetServer(telnetPort);
WiFiClient serverClient[MAX_SRV_CLIENTS];
unsigned long wifiReconnectLastTime = 0;
bool wifiEnable = true;
bool telnetEnable = true;
String deviceName = "";

unsigned long checkSensorLastTime = 0;
unsigned long checkSensorPeriod = 5000;

String uartCommand = "";
bool uartReady = false;

// Log settings for 32 hours of storage
#define LOG_SIZE 192 // Save sensors value each 10 minutes: ( 32hours * 60minutes/hour ) / 10minutes/pcs = 192 pcs
sensorDataCollection history_log[LOG_SIZE];
unsigned int history_record_number = 0;
unsigned long logLastTime = 0;
unsigned long logPeriod = ((60 / (LOG_SIZE / 32)) * 60 * 1000) / 5; // 60minutes/hour / ( 192pcs / 32hours ) * 60seconds/minute * 1000 msec/second
sensorDataCollection sensor;

bool timeIsSet = false;
bool autoReport = false;

// not implemented yet
#ifdef SLEEP_ENABLE
unsigned long reconnectTimeOut = 5000;
bool sleepEnable = false;
#endif

const byte eventsNumber = 10;
#ifdef EVENTS_ENABLE
bool eventsFlags[eventsNumber];
bool eventsEnable = false;

String getEvent(byte n)
{
	int singleEventLength = EVENTS_TABLE_size / eventsNumber;
	String eventStr = readConfigString((EVENTS_TABLE_addr + n * singleEventLength), singleEventLength);
	eventStr.trim();
	return eventStr;
}

void processEvent(String event, byte eventNum)
{
	if (eventsFlags[eventNum]) return;
	//conditions:
	//	value<=>x; adc, temp, hum, co2,
	//	input?=0/1/c;
	//	output?=0/1/c;
	//	counter?>x;
	String condition = event.substring(0, event.indexOf(':'));
	condition.trim();
	if (condition.length() <= 0) return;
	condition.toLowerCase();
	event = event.substring(event.indexOf(':') + 1);
	if (condition.startsWith(F("input")))
	{
		int t = condition.indexOf('=');
		if (t >= 6 && t < condition.length() - 1)
		{
			byte outNum = condition.substring(5, t).toInt();
			String outStateStr = condition.substring(t + 1);
			bool outState = OUT_OFF;
			if (outStateStr != F("c"))
			{
				if (outStateStr == SWITCH_ON) outState = OUT_ON;
				else if (outStateStr == SWITCH_OFF) outState = OUT_OFF;
				else outState = outStateStr.toInt();
			}
			//Serial.println("CheckIn" + String(outNum) + "=" + String(outState));
			const String cTxt = F("c");
#ifdef INPUT1_ENABLE
			if (outNum == 1)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in1 != digitalRead(INPUT1_ENABLE))
					{
						in1 = digitalRead(INPUT1_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT1_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT2_ENABLE
			if (outNum == 2)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in2 != digitalRead(INPUT2_ENABLE))
					{
						in2 = digitalRead(INPUT2_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT2_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT3_ENABLE
			if (outNum == 3)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in3 != digitalRead(INPUT3_ENABLE))
					{
						in3 = digitalRead(INPUT3_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT3_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT4_ENABLE
			if (outNum == 4)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in4 != digitalRead(INPUT4_ENABLE))
					{
						in4 = digitalRead(INPUT4_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT4_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT5_ENABLE
			if (outNum == 5)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in5 != digitalRead(INPUT5_ENABLE))
					{
						in5 = digitalRead(INPUT5_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT5_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT6_ENABLE
			if (outNum == 6)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in6 != digitalRead(INPUT6_ENABLE))
					{
						in6 = digitalRead(INPUT6_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT6_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT7_ENABLE
			if (outNum == 7)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in7 != digitalRead(INPUT7_ENABLE))
					{
						in7 = digitalRead(INPUT7_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT7_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INPUT8_ENABLE
			if (outNum == 8)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (in8 != digitalRead(INPUT8_ENABLE))
					{
						in8 = digitalRead(INPUT8_ENABLE);
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(INPUT8_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
		}
	}
	else if (condition.startsWith(F("output")))
	{
		int t = condition.indexOf('=');
		if (t >= 7 && t < condition.length() - 1)
		{
			byte outNum = condition.substring(6, t).toInt();
			String outStateStr = condition.substring(t + 1);
			int outState = OUT_OFF;
			if (outStateStr != "c")
			{
				if (outStateStr == SWITCH_ON) outState = OUT_ON;
				else if (outStateStr == SWITCH_OFF) outState = OUT_OFF;
				else outState = outStateStr.toInt();
			}
			//Serial.println("CheckOut" + String(outNum) + "=" + String(outState));
			const String cTxt = F("c");
#ifdef OUTPUT1_ENABLE
			if (outNum == 1)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out1 != digitalRead(OUTPUT1_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT1_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT2_ENABLE
			if (outNum == 2)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out2 != digitalRead(OUTPUT2_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT2_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT3_ENABLE
			if (outNum == 3)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out3 != digitalRead(OUTPUT3_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT3_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT4_ENABLE
			if (outNum == 4)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out4 != digitalRead(OUTPUT4_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT4_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT5_ENABLE
			if (outNum == 5)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out5 != digitalRead(OUTPUT5_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT5_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT6_ENABLE
			if (outNum == 6)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out6 != digitalRead(OUTPUT6_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT6_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT7_ENABLE
			if (outNum == 7)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out7 != digitalRead(OUTPUT7_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT7_ENABLE))  ProcessAction(event, eventNum, true);
			}
#endif
#ifdef OUTPUT8_ENABLE
			if (outNum == 8)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (outStateStr == cTxt)
				{
					if (out8 != digitalRead(OUTPUT8_ENABLE))
					{
						ProcessAction(event, eventNum, true);
					}
				}
				else if (outState == digitalRead(OUTPUT8_ENABLE)) ProcessAction(event, eventNum, true);
			}
#endif
		}
	}
	else if (condition.startsWith(F("counter")))
	{
		int t = condition.indexOf('>');
		if (t >= 8 && t < condition.length() - 1)
		{
			byte outNum = condition.substring(7, t).toInt();
			String outStateStr = condition.substring(t + 1);
			int outState = outStateStr.toInt();
			//Serial.println("Counter" + String(outNum) + "=" + String(outState));
#ifdef INTERRUPT_COUNTER1_ENABLE
			if (outNum == 1)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount1 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
			if (outNum == 2)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount2 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
			if (outNum == 3)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount3 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
			if (outNum == 4)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount4 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
			if (outNum == 5)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount5 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
			if (outNum == 6)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount6 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
			if (outNum == 7)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount7 > outState) ProcessAction(event, eventNum, true);
			}
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
			if (outNum == 8)
			{
				Serial.print(F("Event #"));
				Serial.print(String(eventNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (intCount8 > outState) ProcessAction(event, eventNum, true);
			}
#endif
		}
	}

#ifdef ADC_ENABLE
	else if (condition.startsWith(F("adc")) && condition.length() > 4)
	{
		int adcValue = getAdc();
		char operation = condition[3];
		int value = condition.substring(4).toInt();
		//Serial.println("Evaluating: " + String(adcValue) + operation + String(value));
		if ((operation == '>' && adcValue > value) || (operation == '<' && adcValue < value))
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
	}
#endif

