jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
#if defined(DS18B20_ENABLE) || defined(MH_Z19_UART_ENABLE) || defined(MH_Z19_PPM_ENABLE) || defined(AMS2320_ENABLE) || defined(HTU21D_ENABLE) || defined(DHT_ENABLE)
	else if (condition.startsWith(F("temperature")) && condition.length() > 12)
	{
		char oreration = condition[11];
		int value = condition.substring(12).toInt();
		if (oreration == '>' && (int)getTemperature() > value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
		else if (oreration == '<' && (int)getTemperature() < value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
	}
#endif

#if defined(AMS2320_ENABLE) || defined(HTU21D_ENABLE) || defined(DHT_ENABLE)
	else if (condition.startsWith(F("humidity")) && condition.length() > 9)
	{
		char oreration = condition[8];
		int value = condition.substring(9).toInt();
		if (oreration == '>' && (int)getHumidity() > value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
		else if (oreration == '<' && (int)getHumidity() < value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
	}
#endif

#if defined(MH_Z19_UART_ENABLE)|| defined(MH_Z19_PPM_ENABLE)
	else if (condition.startsWith(F("co2")) && condition.length() > 4)
	{
		char oreration = condition[3];
		int value = condition.substring(4).toInt();
		if (oreration == '>' && getCo2() > value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
		else if (oreration == '<' && getCo2() < value)
		{
			Serial.print(F("Event #"));
			Serial.print(String(eventNum));
			Serial.print(F(" started: \""));
			Serial.println(condition);
			ProcessAction(event, eventNum, true);
		}
	}
#endif
}
#endif

// not tested
const byte schedulesNumber = 10;
#ifdef SCHEDULER_ENABLE
bool schedulesFlags[schedulesNumber];
bool schedulerEnable = false;

String getSchedule(byte n)
{
	int singleSchedluleLength = SCHEDULER_TABLE_size / schedulesNumber;
	String scheduleStr = readConfigString((SCHEDULER_TABLE_addr + n * singleSchedluleLength), singleSchedluleLength);
	scheduleStr.trim();
	return scheduleStr;
}

void processSchedule(String schedule, byte scheduleNum)
{
	if (schedulesFlags[scheduleNum]) return;
	//conditions:
	//	daily - daily@hh:mm;action1;action2;...
	//	weekly - weekly@week_day.hh:mm;action1;action2;...
	//	monthly - monthly@month_day.hh:mm;action1;action2;...
	//	date - date@yyyy.mm.dd.hh:mm;action1;action2;...
	int t = schedule.indexOf('@');
	int t1 = schedule.indexOf(';');
	if (t <= 4 || t1 < 11 || t1 < t) return;
	String condition = schedule.substring(0, t);
	condition.trim();
	condition.toLowerCase();
	String time = schedule.substring(t + 1, t1);
	time.trim();
	time.toLowerCase();
	schedule = schedule.substring(t1 + 1);
	if (condition.startsWith(F("daily@")) && t == 5)
	{
		if (time.length() == 5)
		{
			int _hr = time.substring(0, 2).toInt();
			int _min = time.substring(3, 5).toInt();
			if (_hr >= 0 && _hr < 24 && _min >= 0 && _min < 60)
			{
				Serial.print(F("Schedule #"));
				Serial.print(String(scheduleNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (hour() >= _hr && minute() >= _min) ProcessAction(schedule, scheduleNum, false);
			}
		}
	}
	else if (condition.startsWith(F("weekly@")) && t == 6)
	{
		if (time.length() == 7)
		{
			int _weekDay = time.substring(0, 1).toInt();
			int _hr = time.substring(2, 4).toInt();
			int _min = time.substring(5, 7).toInt();
			if (_weekDay > 0 && _weekDay < 8 && _hr >= 0 && _hr < 24 && _min >= 0 && _min < 60)
			{
				Serial.print(F("Schedule #"));
				Serial.print(String(scheduleNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (weekday() == _weekDay && hour() >= _hr && minute() >= _min) ProcessAction(schedule, scheduleNum, false);
			}
		}
	}
	else if (condition.startsWith(F("monthly@")) && t == 7)
	{
		if (time.length() == 8)
		{
			int _monthDay = time.substring(0, 2).toInt();
			int _hr = time.substring(3, 5).toInt();
			int _min = time.substring(6, 8).toInt();
			if (_hr >= 0 && _hr < 24 && _min >= 0 && _min < 60)
			{
				Serial.print(F("Schedule #"));
				Serial.print(String(scheduleNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (day() == _monthDay && hour() >= _hr && minute() >= _min) ProcessAction(schedule, scheduleNum, false);
			}
		}
	}
	else if (condition.startsWith(F("date@")) && t == 4)
	{
		if (time.length() == 16)
		{
			int _yr = time.substring(0, 4).toInt();
			int _month = time.substring(5, 7).toInt();
			int _day = time.substring(8, 10).toInt();
			int _hr = time.substring(11, 13).toInt();
			int _min = time.substring(14, 16).toInt();
			if (_hr >= 0 && _hr < 24 && _min >= 0 && _min < 60)
			{
				Serial.print(F("Schedule #"));
				Serial.print(String(scheduleNum));
				Serial.print(F(" started: \""));
				Serial.println(condition);
				if (year() == _yr && month() == _month && day() == _day && hour() >= _hr && minute() >= _min) ProcessAction(schedule, scheduleNum, false);
			}
		}
	}
}
#endif

// E-mail config
// Need smtp parameters, credentials
#ifdef EMAIL_ENABLE
#include <sendemail.h>
String smtpServerAddress = "";
unsigned int smtpServerPort = 2525;
String smtpLogin = "";
String smtpPassword = "";
String smtpTo = "";
bool eMailEnable = false;

bool sendMail(String address, String subject, String message)
{
	bool result = false;
	if (eMailEnable && WiFi.status() == WL_CONNECTED)
	{
		SendEmail email(smtpServerAddress, smtpServerPort, smtpLogin, smtpPassword, 5000, false);
		result = email.send(smtpLogin, address, subject, message);
	}
	return result;
}

#endif

// Telegram config
// Need token
const byte telegramUsersNumber = 10;
#ifdef TELEGRAM_ENABLE
//#include <WiFiClientSecure.h>
#include "CTBot.h"
CTBot myBot;
const int telegramMessageMaxSize = 300;
typedef struct telegramMessage
{
	byte retries;
	int64_t user;
	String message;
};

String telegramToken = "";
int64_t telegramUsers[telegramUsersNumber];
const byte telegramMessageBufferSize = 10;
telegramMessage telegramOutboundBuffer[telegramMessageBufferSize];
byte telegramOutboundBufferPos = 0;
int telegramMessageDelay = 2000;
byte telegramRetries = 3;
unsigned long telegramLastTime = 0;
bool telegramEnable = false;

String uint64ToString(uint64_t input)
{
	String result = "";
	uint8_t base = 10;
	do
	{
		char c = input % base;
		input /= base;
		if (c < 10) c += '0';
		else c += 'A' - 10;
		result = c + result;
	} while (input);
	return result;
}

