jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
uint64_t StringToUint64(String value)
{
	uint64_t result = 0;

	const char* p = value.c_str();
	const char* q = p + value.length();
	while (p < q)
	{
		result = (result << 1) + (result << 3) + *(p++) - '0';
	}
	return result;
}

bool sendToTelegramServer(int64_t user, String str)
{
	bool result = false;
	if (telegramEnable && WiFi.status() == WL_CONNECTED)
	{
		result = myBot.testConnection();
		if (result)
		{
			String tmpStr = "";
			tmpStr.reserve(str.length() * 3);
			tmpStr = str;
			tmpStr.replace(F("\r"), "");
			tmpStr.replace(F("\n"), F("%0a"));
			tmpStr.replace(F("\t"), F("%09"));
			tmpStr.replace(F(" "), F("%20"));
			tmpStr.replace(F("["), F("%5b"));
			tmpStr.replace(F("]"), F("%5d"));
			tmpStr.replace(F("?"), F("%3f"));
			tmpStr.replace(F("@"), F("%40"));
			tmpStr.replace(F("&"), F("%26"));
			tmpStr.replace(F("\\"), F("5c"));
			tmpStr.replace(F("/"), F("%2f"));
			Serial.print(F("Sending: "));
			Serial.println(tmpStr);
			result = myBot.sendMessage(user, tmpStr);
			if (!result) Serial.println(F("failed"));
			else
			{
				Serial.println(F("success"));
				result = true;
			}
		}
		else Serial.println(F("TELEGRAM connection error"));
	}
	else Serial.println(F("WiFi not connected"));
	return result;
}

void addMessageToTelegramOutboundBuffer(int64_t user, String message, byte retries)
{
	if (telegramOutboundBufferPos >= telegramMessageBufferSize)
	{
		for (int i = 0; i < telegramMessageBufferSize - 1; i++)
		{
			telegramOutboundBuffer[i] = telegramOutboundBuffer[i + 1];
		}
		telegramOutboundBufferPos = telegramMessageBufferSize - 1;
	}
	telegramOutboundBuffer[telegramOutboundBufferPos].user = user;
	telegramOutboundBuffer[telegramOutboundBufferPos].message = message;
	telegramOutboundBuffer[telegramOutboundBufferPos].retries = retries;
	telegramOutboundBufferPos++;
}

void removeMessageFromTelegramOutboundBuffer()
{
	if (telegramOutboundBufferPos <= 0) return;
	for (int i = 0; i < telegramOutboundBufferPos; i++)
	{
		if (i < telegramMessageBufferSize - 1) telegramOutboundBuffer[i] = telegramOutboundBuffer[i + 1];
		else
		{
			telegramOutboundBuffer[i].message = "";
			telegramOutboundBuffer[i].user = 0;
		}
	}
	telegramOutboundBufferPos--;
}

void sendToTelegram(int64_t user, String message, byte retries)
{
	// slice message to pieces
	while (message.length() > 0)
	{
		if (message.length() >= telegramMessageMaxSize)
		{
			addMessageToTelegramOutboundBuffer(user, message.substring(0, telegramMessageMaxSize), retries);
			message = message.substring(telegramMessageMaxSize);
		}
		else
		{
			addMessageToTelegramOutboundBuffer(user, message, retries);
			message = "";
		}
	}
}

void sendBufferToTelegram()
{
	if (telegramEnable && WiFi.status() == WL_CONNECTED && myBot.testConnection())
	{
		bool isRegisteredUser = false;
		bool isAdmin = false;
		TBMessage msg;
		while (myBot.getNewMessage(msg))
		{
			Serial.print(F("Received TELEGRAM message ["));
			Serial.print(msg.sender.username);
			Serial.print(F("]: "));
			Serial.println(msg.text);

			//assign 1st sender as admin if admin is empty
			if (telegramUsers[0] == 0)
			{
				telegramUsers[0] = msg.sender.id;
				Serial.print(F("admin set to ["));
				Serial.print(uint64ToString(telegramUsers[0]));
				Serial.println(F("]"));
			}

			//check if it's registered user
			for (int i = 0; i < telegramUsersNumber; i++)
			{
				if (telegramUsers[i] == msg.sender.id)
				{
					isRegisteredUser = true;
					if (i == 0) isAdmin = true;
					break;
				}
			}

			//process data from TELEGRAM
			if (isRegisteredUser && msg.text.length() > 0)
			{
				Serial.println(F("User is registered"));
				sendToTelegram(msg.sender.id, deviceName + ": " + msg.text, telegramRetries);
				String str = processCommand(msg.text, TELEGRAM_CHANNEL, isAdmin);
				Serial.print(F("Command answer: "));
				Serial.println(str);
				sendToTelegram(msg.sender.id, deviceName + ": " + str, telegramRetries);
			}
			yield();
		}

		if (telegramOutboundBuffer[0].message.length() != 0)
		{
			if (sendToTelegramServer(telegramOutboundBuffer[0].user, telegramOutboundBuffer[0].message))
			{
				removeMessageFromTelegramOutboundBuffer();
			}
			else
			{
				telegramOutboundBuffer[0].retries--;
				if (telegramOutboundBuffer[0].retries <= 0)
				{
					removeMessageFromTelegramOutboundBuffer();
				}
			}
		}
	}
}

String getTelegramUser(byte n)
{
	int singleUserLength = TELEGRAM_USERS_TABLE_size / telegramUsersNumber;
	String userStr = readConfigString((TELEGRAM_USERS_TABLE_addr + n * singleUserLength), singleUserLength);
	userStr.trim();
	return userStr;
}

#endif

// not implemented yet
// Google script config
// Need token
#ifdef GSCRIPT
#include <HTTPSRedirect.h>
String gScriptId = "";
const char* host = "script.google.com";
//const char* googleRedirHost = "script.googleusercontent.com";
//const char* fingerprint = "C2 00 62 1D F7 ED AF 8B D1 D5 1D 24 D6 F0 A1 3A EB F1 B4 92";
//String[] valuesNames = {"?tag", "?value="};
const int httpsPort = 443;
bool gScriptEnable = false;

bool sendValueToGoogle(String value)
{
	bool flag = false;
	if (gScriptEnable && WiFi.status() == WL_CONNECTED)
	{
		HTTPSRedirect* gScriptClient = nullptr;
		gScriptClient = new HTTPSRedirect(httpsPort);
		gScriptClient->setInsecure();
		gScriptClient->setPrintResponseBody(true);

		for (int i = 0; i < 5; i++)
		{
			int retval = gScriptClient->connect(host, httpsPort);
			if (retval == 1)
			{
				flag = true;
				break;
			}
			else
			{
				Serial.println("Connection failed. Retrying...");
			}
		}
		if (!flag) Serial.println("Connection failed.");
		String urlFinal = F("/macros/s/");
		urlFinal += gScriptId;
		urlFinal += F("/exec");
		urlFinal += F("?value=");
		urlFinal += value;
		Serial.print(F("GScript sending: "));
		Serial.println(urlFinal);
		Serial.print(F("free heap: "));
		Serial.println(String(system_get_free_heap_size()));
		system_print_meminfo();
		flag = gScriptClient->GET(urlFinal, host, true);
		gScriptClient->stopAll;
		gScriptClient->~HTTPSRedirect();
		if (!flag) Serial.println("Sending failed.");
	}
	return flag;
}
#endif

