jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
// Pushingbox config
// PushingBox device ID
#ifdef PUSHINGBOX
#define PUSHINGBOX_SUBJECT F("device_name")
String pushingBoxId = "";
String pushingBoxParameter = "";
const int pushingBoxMessageMaxSize = 1000;
const char* pushingBoxServer = "api.pushingbox.com";
bool pushingBoxEnable = false;

bool sendToPushingBoxServer(String message)
{
	bool flag = false;
	if (pushingBoxEnable && WiFi.status() == WL_CONNECTED)
	{
		WiFiClient client;

		//Serial.println("- connecting to pushing server ");
		if (client.connect(pushingBoxServer, 80))
		{
			//Serial.println("- succesfully connected");

			String postStr = F("devid=");
			postStr += pushingBoxId;
			postStr += F("&");
			postStr += PUSHINGBOX_SUBJECT;
			postStr += F("=");
			postStr += deviceName;
			postStr += F("&");
			postStr += pushingBoxParameter;
			postStr += F("=");
			postStr += String(message);
			postStr += F("\r\n\r\n");

			//Serial.println("- sending data...");

			client.print(F("POST /pushingbox HTTP/1.1\n"));
			client.print(F("Host: "));
			client.print(String(pushingBoxServer));
			client.print(F("\nConnection: close\n"));
			client.print(F("Content-Type: application/x-www-form-urlencoded\n"));
			client.print(F("Content-Length: "));
			client.print(postStr.length());
			client.print(F("\n\n"));
			client.print(postStr);
			//Serial.println(postStr);
			// check server reply
			flag = true;
		}
		client.stop();
		//Serial.println("- stopping the client");
	}
	return flag;
}

bool sendToPushingBox(String message)
{
	// slice message to pieces
	while (message.length() > 0)
	{
		if (message.length() >= pushingBoxMessageMaxSize)
		{
			sendToPushingBoxServer(message.substring(0, pushingBoxMessageMaxSize));
			message = message.substring(pushingBoxMessageMaxSize);
		}
		else
		{
			sendToPushingBoxServer(message);
			message = "";
		}
	}
}
#endif

// HTTP server
// Need port 
#ifdef HTTP_SERVER_ENABLE
#include <ESP8266WebServer.h>
unsigned int httpPort = 80;
ESP8266WebServer http_server(httpPort);
bool httpServerEnable = false;

String HTML_footer()
{
	return F("<br />\r\n</html>\r\n");
}

void handleRoot()
{
	String str = F("HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nConnection: close\r\nRefresh: ");
	str += String(round(checkSensorPeriod / 1000));
	str += F("\r\n\r\n<!DOCTYPE HTML>\r\n<html>\r\n");
	str += ParseSensorReport(history_log[history_record_number - 1], F("<br>"));
	http_server.sendContent(str);
}

void handleNotFound()
{
	String message = F("File Not Found\n\nURI: ");
	message += http_server.uri();
	message += F("\nMethod: ");
	message += (http_server.method() == HTTP_GET) ? F("GET") : F("POST\nArguments: ");
	message += http_server.args();
	message += eol;
	for (uint8_t i = 0; i < http_server.args(); i++)
	{
		message += F(" ");
		message += http_server.argName(i);
		message += F(": ");
		message += http_server.arg(i);
		message += eol;
		yield();
	}
	http_server.send(404, F("text/plain"), message);
}
#endif

// NTP Server
// Need server address, local time zone
#ifdef NTP_TIME_ENABLE
#include <WiFiUdp.h>
#define NTP_PACKET_SIZE 48 // NTP time is in the first 48 bytes of message
IPAddress timeServer(129, 6, 15, 28); //129.6.15.28 = time-a.nist.gov
WiFiUDP Udp;
int timeZone = +3;     // Moscow Time
const unsigned int localPort = 8888;  // local port to listen for UDP packets
int ntpRefreshDelay = 180;
bool NTPenable = false;

// send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress& address)
{
	byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets
	// set all bytes in the buffer to 0
	memset(packetBuffer, 0, NTP_PACKET_SIZE);
	// Initialize values needed to form NTP request
	// (see URL above for details on the packets)
	packetBuffer[0] = 0b11100011;   // LI, Version, Mode
	packetBuffer[1] = 0;     // Stratum, or type of clock
	packetBuffer[2] = 6;     // Polling Interval
	packetBuffer[3] = 0xEC;  // Peer Clock Precision
	// 8 bytes of zero for Root Delay & Root Dispersion
	packetBuffer[12] = 49;
	packetBuffer[13] = 0x4E;
	packetBuffer[14] = 49;
	packetBuffer[15] = 52;
	// all NTP fields have been given values, now
	// you can send a packet requesting a timestamp:
	Udp.beginPacket(address, 123); //NTP requests are to port 123
	Udp.write(packetBuffer, NTP_PACKET_SIZE);
	Udp.endPacket();
}

time_t getNtpTime()
{
	if (!NTPenable || WiFi.status() != WL_CONNECTED) return 0;

	while (Udp.parsePacket() > 0) yield(); // discard any previously received packets
	//Serial.print(F("NTP Request..."));
	sendNTPpacket(timeServer);
	uint32_t beginWait = millis();
	while (millis() - beginWait < 1500)
	{
		int size = Udp.parsePacket();
		if (size >= NTP_PACKET_SIZE)
		{
			//Serial.println(F("OK"));
			byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets
			Udp.read(packetBuffer, NTP_PACKET_SIZE);  // read packet into the buffer
			timeIsSet = true;
			unsigned long secsSince1900;
			// convert four bytes starting at location 40 to a long integer
			secsSince1900 = (unsigned long)packetBuffer[40] << 24;
			secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
			secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
			secsSince1900 |= (unsigned long)packetBuffer[43];
			NTPenable = false;
			setSyncProvider(nullptr);
			Udp.stop();
			return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
		}
	}
	//Serial.println(F("failed"));
	return 0; // return 0 if unable to get the time
}
#endif

/*
AM2320 I2C temperature + humidity sensor
PINS: D1 - SCL, D2 - SDA
pin 1 of the sensor to +3.3V/+5V
pin 2 of the sensor to SDA
pin 3 of the sensor to GND
pin 4 of the sensor to SCL
5-10K pullup resistor from pin 2 (SDA) to pin 1 (power) of the sensor
5-10K pullup resistor from pin 4 (SCL) to pin 1 (power) of the sensor
*/
#ifdef AMS2320_ENABLE
#include "Adafruit_Sensor.h"
#include "Adafruit_AM2320.h"
Adafruit_AM2320 am2320 = Adafruit_AM2320();
#endif

// HTU21D I2C temperature + humidity sensor
// PINS: D1 - SCL, D2 - SDA
#ifdef HTU21D_ENABLE
#include <Wire.h>
#include "Adafruit_HTU21DF.h"
Adafruit_HTU21DF htu21d = Adafruit_HTU21DF();
#endif

// BME280 I2C temperature + humidity + pressure sensor
// PINS: D1 - SCL, D2 - SDA
#ifdef BME280_ENABLE
#include "Adafruit_Sensor.h"
#include "Adafruit_BME280.h"
#define BME280_ADDRESS 0xF6
Adafruit_BME280 bme;
#endif

