jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
#ifdef SLEEP_ENABLE
		//try to connect WiFi to get commands
		if (sleepEnable && wiFiIntendedStatus == WIFI_CONNECTING && WiFi.status() != WL_CONNECTED && millis() - reconnectTimeStart < reconnectTimeOut)
		{
			Serial.println(F("Reconnecting..."));
			while (WiFi.status() != WL_CONNECTED && millis() - reconnectTimeStart < reconnectTimeOut)
			{
				delay(50);
				if (WiFi.status() == WL_CONNECTED) wiFiIntendedStatus = WIFI_CONNECTED;
				yield();
			}
		}
#endif
	}

	//check if it's time to get sensors value
	if (millis() - checkSensorLastTime > checkSensorPeriod)
	{
		checkSensorLastTime = millis();
		String str = deviceName;
		str += F(": ");
		sensor = collectData();
		if (autoReport)
		{
			str += ParseSensorReport(sensor, eol);
			Serial.println(str);
			if (WiFi.status() == WL_CONNECTED)
			{
				for (int i = 0; i < MAX_SRV_CLIENTS; i++)
				{
					if (serverClient[i] && serverClient[i].connected())
					{
						sendToNet(str, i);
						yield();
					}
				}

#ifdef TELEGRAM_ENABLE
				if (telegramEnable)
				{
					for (int i = 0; i < telegramUsersNumber; i++)
					{
						if (telegramUsers[i] > 0)
						{
							sendToTelegram(telegramUsers[i], str, telegramRetries);
						}
					}
				}
#endif

#ifdef GSCRIPT
				if (gScriptEnable) sendValueToGoogle("test_gscript");
#endif
			}
		}
	}

	//check if it's time to collect log
	if (millis() - logLastTime > logPeriod)
	{
		logLastTime = millis();
		saveLog(collectData());

#ifdef EMAIL_ENABLE
		if (history_record_number >= (int)(LOG_SIZE * 0.7))
		{
			if (eMailEnable && WiFi.status() == WL_CONNECTED && history_record_number > 0)
			{
				bool sendOk = true;
				int n = 0;
				String tmpStr = ParseSensorReport(history_log[n], divider);
				tmpStr += eol;
				n++;
				while (n < history_record_number)
				{
					int freeMem = ESP.getFreeHeap() / 3;
					for (; n < (freeMem / tmpStr.length()) - 1; n++)
					{
						if (n >= history_record_number) break;

						Serial.print(F("history_record_number="));
						Serial.println(String(history_record_number));
						Serial.print(F("freeMem="));
						Serial.println(String(freeMem));
						Serial.print(F("n="));
						Serial.println(String(n));

						tmpStr += ParseSensorReport(history_log[n], divider);
						tmpStr += eol;
						yield();
					}
					sendOk = sendMail(smtpTo, deviceName + " log", tmpStr);
					tmpStr = "";
					yield();
					if (sendOk)
					{
						Serial.println(F("Log sent to EMail"));
						history_record_number = 0;
					}
					else
					{
						Serial.print(F("Error sending log to EMail "));
						Serial.print(String(history_record_number));
						Serial.println(F(" records."));
					}
				}
			}
		}
#endif
	}

	//check UART for data
	while (Serial.available() && !uartReady)
	{
		char c = Serial.read();
		if (c == '\r' || c == '\n') uartReady = true;
		else uartCommand += (char)c;
	}

	//process data from UART
	if (uartReady)
	{
		uartReady = false;
		if (uartCommand.length() > 0)
		{
			String str = processCommand(uartCommand, UART_CHANNEL, true);
			Serial.println(str);
		}
		uartCommand = "";
	}

	//process data from HTTP/Telnet/TELEGRAM if available
	if (WiFi.status() == WL_CONNECTED)
	{
#ifdef HTTP_SERVER_ENABLE
		if (httpServerEnable) http_server.handleClient();
#endif

		if (telnetEnable)
		{
			//check if there are any new clients
			if (telnetServer.hasClient())
			{
				int i;
				for (i = 0; i < MAX_SRV_CLIENTS; i++)
				{
					//find free/disconnected spot
					if (!serverClient[i] || !serverClient[i].connected())
					{
						if (serverClient[i])
						{
							serverClient[i].stop();
						}
						serverClient[i] = telnetServer.available();
						Serial.println(F("Client connected: #"));
						Serial.println(String(i));
						break;
					}
				}
				//no free/disconnected spot so reject
				if (i >= MAX_SRV_CLIENTS)
				{
					WiFiClient serverClient = telnetServer.available();
					serverClient.stop();
					Serial.print(F("No more slots. Client rejected."));
				}
			}

			//check network clients for data
			for (int i = 0; i < MAX_SRV_CLIENTS; i++)
			{
				if (serverClient[i] && serverClient[i].connected())
				{
					if (serverClient[i].available())
					{
						//get data from the telnet client
						while (serverClient[i].available()) netInput[i] = serverClient[i].readString();
					}
				}
				yield();
			}

			//Process data from network
			for (int i = 0; i < MAX_SRV_CLIENTS; i++)
			{
				if (netInput[i].length() > 0)
				{
					String str = processCommand(netInput[i], TELNET_CHANNEL, true);
					sendToNet(str, i);
					netInput[i] = "";
				}
				yield();
			}
		}

#ifdef TELEGRAM_ENABLE
		//check TELEGRAM for data
		if (telegramEnable && millis() - telegramLastTime > telegramMessageDelay && WiFi.status() == WL_CONNECTED)
		{
			sendBufferToTelegram();
			telegramLastTime = millis();
		}
#endif
	}

#ifdef TM1637DISPLAY_ENABLE
	if (millis() - displaySwitchedLastTime > displaySwitchPeriod)
	{
		displaySwitchedLastTime = millis();

		//show CO2
		if (displayState == 0)
		{
			int co2_avg = getCo2();
			if (co2_avg > -1000) display.showNumberDec(co2_avg, false);
			else displayState++;
		}
		//show Temperature
		if (displayState == 1)
		{
			int temp = (int)getTemperature();
			if (temp > -1000)
			{
				display.showNumberDec(temp, false, 3, 0);
				display.setSegments(SEG_DEGREE, 1, 3);
			}
			else displayState++;
		}
		//show Humidity
		if (displayState == 2)
		{
			int humidity = (int)getHumidity();
			if (humidity > -1000)
			{
				display.showNumberDec(humidity, false, 3, 0);
				display.setSegments(SEG_HUMIDITY, 1, 3);
			}
			else displayState++;
		}
		//show clock
		if (displayState == 3)
		{
			if (timeIsSet)
			{
				display.showNumberDecEx(hour(), 0xff, true, 2, 0);
				display.showNumberDecEx(minute(), 0xff, true, 2, 2);
			}
			else displayState++;
		}
		displayState++;
		if (displayState > 3) displayState = 0;
	}
#endif

#ifdef SSD1306DISPLAY_ENABLE
	if (millis() - displaySwitchedLastTime > displaySwitchPeriod)
	{
		displaySwitchedLastTime = millis();

