jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
		oled.clear();
		String tmpStr = "";
		byte n = 0;
		//show WiFi status
		//if (WiFi.status() == WL_CONNECTED) tmpStr += F("Wi-Fi: ok\r\n");
		//else tmpStr += F("Wi-Fi: fail\r\n");
		n++;

		//show clock
		if (timeIsSet)
		{
			int _hr = hour();
			int _min = minute();
			if (_hr < 10) tmpStr += F("0");
			tmpStr += String(_hr);
			tmpStr += F(":");
			if (_min < 10) tmpStr += F("0");
			tmpStr += String(_min);
			tmpStr += F("\r\n");
			n++;
		}

		//show Temperature
		float temp = getTemperature();
		if (temp > -1000)
		{
			tmpStr += F("T: ");
			tmpStr += String(temp);
			tmpStr += F("\r\n");
			n++;
		}

		//show Humidity
		float humidity = getHumidity();
		if (humidity > -1000)
		{
			tmpStr += F("H: ");
			tmpStr += String(humidity);
			tmpStr += F("%\r\n");
			n++;
		}

		//show CO2
		int co2_avg = getCo2();
		//Serial.println("CO2 display: " + String(co2_avg));
		if (co2_avg > -1000)
		{
			tmpStr += F("CO2: ");
			tmpStr += String(co2_avg);
			tmpStr += "\r\n";
			n++;
		}

		if (n < 3) oled.set2X();
		else oled.set1X();
		oled.print(tmpStr);
	}
#endif

#ifdef EVENTS_ENABLE
	if (eventsEnable)
	{
		for (int i = 0; i < eventsNumber; i++)
		{
			String eventStr = getEvent(i);
			if (eventStr.length() > 0)
			{
				processEvent(eventStr, i);
			}
		}
	}
#endif

#ifdef SCHEDULER_ENABLE
	if (schedulerEnable && timeIsSet)
	{
		// reset flags at the start of the day
		/*if (false)
		{
			for (int i = 0; i < schedulesNumber; i++)schedulesFlags[schedulesNumber];
		}*/

		// Process all schedules from EEPROM
		for (int i = 0; i < schedulesNumber; i++)
		{
			String scheduleStr = getSchedule(i);
			if (scheduleStr.length() > 0)
			{
				processSchedule(scheduleStr, i);
			}
		}
	}
#endif

#ifdef SLEEP_ENABLE
	if (sleepEnable)
	{
		unsigned long int ms = millis() - checkSensorLastTime;
		if (ms < checkSensorPeriod)
		{
			Serial.print(F("Sleep "));
			Serial.print(String(checkSensorPeriod - ms));
			Serial.println(F("ms"));
			Serial.flush();
			ESP.deepSleep((checkSensorPeriod - ms) * 1000);
		}
	}
#endif
}

int CollectEepromSize()
{
	int eeprom_size = SSID_size;
	eeprom_size += PASS_size;
	eeprom_size += TELNET_PORT_size;
	eeprom_size += SENSOR_READ_DELAY_size;
	eeprom_size += DEVICE_NAME_size;

	eeprom_size += ENABLE_SLEEP_size;

	eeprom_size += EVENTS_TABLE_size;
	eeprom_size += ENABLE_EVENTS_size;

	eeprom_size += SCHEDULER_TABLE_size;
	eeprom_size += ENABLE_SCHEDULER_size;

	eeprom_size += SMTP_SERVER_ADDRESS_size;
	eeprom_size += SMTP_SERVER_PORT_size;
	eeprom_size += SMTP_LOGIN_size;
	eeprom_size += SMTP_PASSWORD_size;
	eeprom_size += SMTP_TO_size;
	eeprom_size += ENABLE_EMAIL_size;

	eeprom_size += TELEGRAM_TOKEN_size;
	eeprom_size += TELEGRAM_USERS_TABLE_size;
	eeprom_size += ENABLE_TELEGRAM_size;

	eeprom_size += GSCRIPT_ID_size;
	eeprom_size += ENABLE_GSCRIPT_size;

	eeprom_size += PUSHINGBOX_ID_size;
	eeprom_size += PUSHINGBOX_PARAM_size;
	eeprom_size += ENABLE_PUSHINGBOX_size;

	eeprom_size += HTTP_PORT_size;
	eeprom_size += ENABLE_HTTP_size;

	eeprom_size += NTP_SERVER_size;
	eeprom_size += NTP_TIME_ZONE_size;
	eeprom_size += NTP_REFRESH_DELAY_size;
	eeprom_size += ENABLE_NTP_size;

	eeprom_size += DISPLAY_REFRESH_size;

	eeprom_size += INT1_MODE_size;
	eeprom_size += INT2_MODE_size;
	eeprom_size += INT3_MODE_size;
	eeprom_size += INT4_MODE_size;
	eeprom_size += INT5_MODE_size;
	eeprom_size += INT6_MODE_size;
	eeprom_size += INT7_MODE_size;
	eeprom_size += INT8_MODE_size;

	eeprom_size += OUT1_INIT_size;
	eeprom_size += OUT2_INIT_size;
	eeprom_size += OUT3_INIT_size;
	eeprom_size += OUT4_INIT_size;
	eeprom_size += OUT5_INIT_size;
	eeprom_size += OUT6_INIT_size;
	eeprom_size += OUT7_INIT_size;
	eeprom_size += OUT8_INIT_size;

	return eeprom_size;
}

String readConfigString(int startAt, int maxlen)
{
	String str = "";
	for (int i = 0; i < maxlen; i++)
	{
		char c = (char)EEPROM.read(i + startAt);
		if (c == 0) i = maxlen;
		else str += c;
		yield();
	}
	return str;
}

void writeConfigString(int startAt, int maxlen, String str)
{
	for (int i = 0; i < maxlen; i++)
	{
		if (i < str.length())EEPROM.write(i + startAt, (uint8_t)str[i]);
		else EEPROM.write(i + startAt, 0);
		yield();
	}
	EEPROM.commit();
}

void sendToNet(String str, int clientN)
{
	if (serverClient[clientN] && serverClient[clientN].connected())
	{
		serverClient[clientN].print(str);
		delay(1);
	}
}

String printConfig()
{
	String str = F("Device name: \"");
	str += readConfigString(DEVICE_NAME_addr, DEVICE_NAME_size);
	str += quote;
	str += eol;
	str += F("WiFi AP: \"");
	str += readConfigString(SSID_addr, SSID_size);
	str += quote;
	str += eol;
	str += F("WiFi Password: \"");
	str += readConfigString(PASS_addr, PASS_size);
	str += quote;
	str += eol;
	str += F("Telnet port: ");
	str += readConfigString(TELNET_PORT_addr, TELNET_PORT_size);
	str += eol;
	str += F("Sensor read period: ");
	str += readConfigString(SENSOR_READ_DELAY_addr, SENSOR_READ_DELAY_size);
	str += eol;
	str += F("Telnet clients limit: ");
	str += String(MAX_SRV_CLIENTS);
	str += eol;

	//Log settings
	str += F("Device log size: ");
	str += String(LOG_SIZE);
	str += eol;
	str += F("Log record period: ");
	str += String(logPeriod);
	str += eol;

#ifdef SLEEP_ENABLE
	str += F("WiFi reconnect timeout for SLEEP mode: ");
	str += String(reconnectTimeOut);
	str += eol;
#endif

#ifdef HTTP_SERVER_ENABLE
	str += F("HTTP port: ");
	str += readConfigString(HTTP_PORT_addr, HTTP_PORT_size);
	str += eol;
	str += F("HTTP service enabled: ");
	str += readConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size);
	str += eol;
#endif

#ifdef EMAIL_ENABLE
	str += F("SMTP server: \"");
	str += readConfigString(SMTP_SERVER_ADDRESS_addr, SMTP_SERVER_ADDRESS_size);
	str += quote;
	str += eol;
	str += F("SMTP port: ");
	str += readConfigString(SMTP_SERVER_PORT_addr, SMTP_SERVER_PORT_size);
	str += eol;
	str += F("SMTP login: \"");
	str += readConfigString(SMTP_LOGIN_addr, SMTP_LOGIN_size);
	str += quote;
	str += eol;
	str += F("SMTP password: \"");
	str += readConfigString(SMTP_PASSWORD_addr, SMTP_PASSWORD_size);
	str += quote;
	str += eol;
	str += F("Email To: \"");
	str += readConfigString(SMTP_TO_addr, SMTP_TO_size);
	str += quote;
	str += eol;
	str += F("EMAIL service enabled: ");
	str += readConfigString(ENABLE_EMAIL_addr, ENABLE_EMAIL_size);
	str += eol;
#endif

#ifdef TELEGRAM_ENABLE
	str += F("TELEGRAM token: \"");
	str += readConfigString(TELEGRAM_TOKEN_addr, TELEGRAM_TOKEN_size);
	str += quote;
	str += eol;
	str += F("Admin #0: ");
	str += getTelegramUser(0);
	str += eol;
	for (int i = 1; i < telegramUsersNumber; i++)
	{
		str += F("\tUser #");
		str += String(i);
		str += F(": ");
		str += getTelegramUser(i);
		str += eol;
	}
	str += F("TELEGRAM service enabled: ");
	str += readConfigString(ENABLE_TELEGRAM_addr, ENABLE_TELEGRAM_size);
	str += eol;
#endif

