jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
		else if (tmp.startsWith(F("set_interrupt_mode")) && command.length() > 20)
		{
			int t = command.indexOf('=');
			if (t >= 19 && t < command.length() - 1)
			{
				byte outNum = command.substring(18, t).toInt();
				String intMode = command.substring(t + 1);
				//Serial.println("Out" + String(outNum) + "=" + intMode);
				byte intModeNum = 0;
				if (intMode == F("rising")) intModeNum = RISING;
				else if (intMode == F("falling")) intModeNum = FALLING;
				else if (intMode == F("change")) intModeNum = CHANGE;
				else
				{
					str = F("Incorrect value \"");
					str += String(intMode);
					str += quote;
				}
				//Serial.println("InterruptMode" + String(outNum) + "=" + String(intModeNum));
				const String outTxt1 = F("Interrupt #");
				const String outTxt2 = F(" mode: ");
#ifdef INTERRUPT_COUNTER1_ENABLE
				if (outNum == 1)
				{
					intMode1 = intModeNum;
					writeConfigString(INT1_MODE_addr, INT1_MODE_size, String(intMode1));
					attachInterrupt(INTERRUPT_COUNTER1_ENABLE, int1count, intMode1);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
				if (outNum == 2)
				{
					intMode2 = intModeNum;
					writeConfigString(INT2_MODE_addr, INT2_MODE_size, String(intMode2));
					attachInterrupt(INTERRUPT_COUNTER2_ENABLE, int2count, intMode2);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
				if (outNum == 3)
				{
					intMode3 = intModeNum;
					writeConfigString(INT3_MODE_addr, INT3_MODE_size, String(intMode3));
					attachInterrupt(INTERRUPT_COUNTER3_ENABLE, int3count, intMode3);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
				if (outNum == 4)
				{
					intMode4 = intModeNum;
					writeConfigString(INT4_MODE_addr, INT4_MODE_size, String(intMode4));
					attachInterrupt(INTERRUPT_COUNTER4_ENABLE, int4count, intMode4);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
				if (outNum == 5)
				{
					intMode5 = intModeNum;
					writeConfigString(INT5_MODE_addr, INT5_MODE_size, String(intMode5));
					attachInterrupt(INTERRUPT_COUNTER5_ENABLE, int5count, intMode5);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
				if (outNum == 6)
				{
					intMode6 = intModeNum;
					writeConfigString(INT6_MODE_addr, INT6_MODE_size, String(intMode6));
					attachInterrupt(INTERRUPT_COUNTER6_ENABLE, int6count, intMode6);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
				if (outNum == 7)
				{
					intMode7 = intModeNum;
					writeConfigString(INT7_MODE_addr, INT7_MODE_size, String(intMode7));
					attachInterrupt(INTERRUPT_COUNTER7_ENABLE, int7count, intMode7);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
				if (outNum == 8)
				{
					intMode8 = intModeNum;
					writeConfigString(INT8_MODE_addr, INT8_MODE_size, String(intMode8));
					attachInterrupt(INTERRUPT_COUNTER8_ENABLE, int8count, intMode8);
					str = outTxt1;
					str += String(outNum);
					str += outTxt2;
					str += intMode;
				}
#endif
				if (str.length() == 0)
				{
					str = F("Incorrect interrupt #");
					str += String(outNum);
					str += eol;
				}
			}
			else
			{
				str = F("Incorrect command");
				str += String(command);
				str += eol;
			}
		}

		//getLog=uart/telnet/email/telegram

#ifdef SLEEP_ENABLE
		else if (tmp.startsWith(F("sleep_enable=")) && command.length() > 13)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				sleepEnable = false;
				writeConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size, SWITCH_OFF_NUMBER);
				str = F("SLEEP mode disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				sleepEnable = true;
				writeConfigString(ENABLE_SLEEP_addr, ENABLE_SLEEP_size, SWITCH_ON_NUMBER);
				str = F("SLEEP mode enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef HTTP_SERVER_ENABLE
		else if (tmp.startsWith(F("http_port=")) && command.length() > 10)
		{
			httpPort = command.substring(command.indexOf('=') + 1).toInt();
			str = F("New HTTP port = \"");
			str += String(httpPort);
			str += quote;
			str += eol;
			writeConfigString(HTTP_PORT_addr, HTTP_PORT_size, String(httpPort));
			if (httpServerEnable) http_server.begin(httpPort);
		}
		else if (tmp.startsWith(F("http_enable=")) && command.length() > 12)
		{
			String stateStr = command.substring(command.indexOf('=') + 1);
			if (stateStr == SWITCH_OFF_NUMBER || stateStr == SWITCH_OFF)
			{
				writeConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size, SWITCH_OFF_NUMBER);
				httpServerEnable = false;
				if (httpServerEnable) http_server.stop();
				str = F("HTTP server disabled\r\n");
			}
			else if (stateStr == SWITCH_ON_NUMBER || stateStr == SWITCH_ON)
			{
				writeConfigString(ENABLE_HTTP_addr, ENABLE_HTTP_size, SWITCH_ON_NUMBER);
				httpServerEnable = true;
				http_server.on("/", handleRoot);
				http_server.onNotFound(handleNotFound);
				http_server.begin(httpPort);
				str = F("HTTP server enabled\r\n");
			}
			else
			{
				str = F("Incorrect value: ");
				str += stateStr;
				str += eol;
			}
		}
#endif

#ifdef EMAIL_ENABLE
		// test function
		/*else if (tmp == F("mailme"))
		{
			if (eMailEnable && WiFi.status() == WL_CONNECTED)
			{
				if (history_record_number < 1) str = "No log records";
				bool sendOk = true;
				int n = 0;
				String tmpStr = ParseSensorReport(history_log[n], divider);
				tmpStr += eol;
				n++;
				while (n < history_record_number)
				{
					int freeMem = ESP.getFreeHeap() / 3;
					//Serial.println("***");
					for (; n < (freeMem / tmpStr.length()) - 1; n++)
					{
						if (n >= history_record_number) break;

