jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
#if defined(EVENTS_ENABLE) || defined(SCHEDULER_ENABLE)
void ProcessAction(String action, byte eventNum, bool eventOrSchedule)
{
	if (eventOrSchedule)
	{
#ifdef EVENTS_ENABLE
		eventsFlags[eventNum] = true;
#endif
	}
	else
	{
#ifdef SCHEDULER_ENABLE
		schedulesFlags[eventNum] = true;
#endif
	}

	do
	{
		int t = action.indexOf(divider);
		String tmpAction;
		if (t > 0)
		{
			tmpAction = action.substring(0, t);
			action = action.substring(t + 1);
		}
		else
		{
			tmpAction = action;
			action = "";
		}
		Serial.print(F("Processing action: "));
		Serial.println(tmpAction);
		//set_output?=x
		if (tmpAction.startsWith(F("set_output")) && tmpAction.length() >= 12)
		{
			Serial.println(set_output(tmpAction));
		}
		//reset_counter?
		else if (tmpAction.startsWith(F("reset_counter")) && tmpAction.length() > 13)
		{
			int n = tmpAction.substring(13).toInt();

#ifdef INTERRUPT_COUNTER1_ENABLE
			if (n == 1) intCount1 = 0;
#endif
#ifdef INTERRUPT_COUNTER2_ENABLE
			if (n == 2) intCount2 = 0;
#endif
#ifdef INTERRUPT_COUNTER3_ENABLE
			if (n == 3) intCount3 = 0;
#endif
#ifdef INTERRUPT_COUNTER4_ENABLE
			if (n == 4) intCount4 = 0;
#endif
#ifdef INTERRUPT_COUNTER5_ENABLE
			if (n == 5) intCount5 = 0;
#endif
#ifdef INTERRUPT_COUNTER6_ENABLE
			if (n == 6) intCount6 = 0;
#endif
#ifdef INTERRUPT_COUNTER7_ENABLE
			if (n == 7) intCount7 = 0;
#endif
#ifdef INTERRUPT_COUNTER8_ENABLE
			if (n == 8) intCount8 = 0;
#endif
		}
		//reset_flag?
#ifdef EVENTS_ENABLE
		else if (tmpAction.startsWith(F("reset_flag")) && tmpAction.length() > 10)
		{
			int n = tmpAction.substring(10).toInt();
			eventsFlags[n] = false;
		}
		else if (tmpAction.startsWith(F("set_flag")) && tmpAction.length() > 8)
		{
			int n = tmpAction.substring(8).toInt();
			eventsFlags[n] = true;
		}
#endif
		//send_telegram=* / user#,message
#ifdef TELEGRAM_ENABLE
		else if (telegramEnable && tmpAction.startsWith(F("send_telegram=")))
		{
			int i = 0;
			int j = 0;
			if (tmpAction[14] == '*') //if * then all
			{
				i = 0;
				j = telegramUsersNumber;
			}
			else
			{
				i = tmpAction.substring(14, tmpAction.indexOf(',')).toInt();
				j = i + 1;
			}
			tmpAction = tmpAction.substring(tmpAction.indexOf(',') + 1);
			sensor = collectData();
			for (; i < j; i++)
			{
				if (telegramUsers[i] > 0)
				{
					String tmpStr = deviceName;
					tmpStr += F(":");
					tmpStr += divider;
					tmpStr += tmpAction;
					tmpStr += eol;
					tmpStr += ParseSensorReport(sensor, eol);
					//sendToTelegram(telegramUsers[i], tmpStr, telegramRetries);
					bool sendOk = sendToTelegramServer(telegramUsers[i], tmpStr);
					if (!sendOk)
					{
#ifdef EVENTS_ENABLE
						eventsFlags[eventNum] = false;
#endif
					}
				}
			}
		}
#endif
		//send_PushingBox=message
#ifdef PUSHINGBOX
		else if (pushingBoxEnable && tmpAction.startsWith(F("send_pushingbox")))
		{
			tmpAction = tmpAction.substring(tmpAction.indexOf('=') + 1);
			sensor = collectData();
			String tmpStr = deviceName;
			tmpStr += F(": ");
			tmpStr += tmpAction;
			tmpStr += eol;
			tmpStr += ParseSensorReport(sensor, eol);
			bool sendOk = sendToPushingBox(tmpStr);
			if (!sendOk)
			{
#ifdef EVENTS_ENABLE
				eventsFlags[eventNum] = false;
#endif
			}
		}
#endif
		//send_mail=address,message
#ifdef EMAIL_ENABLE
		else if (eMailEnable && tmpAction.startsWith(F("send_mail")))
		{
			String address = tmpAction.substring(10, tmpAction.indexOf(','));
			tmpAction = tmpAction.substring(tmpAction.indexOf(',') + 1);
			sensor = collectData();
			String tmpStr = tmpAction;
			tmpStr += eol;
			tmpStr += ParseSensorReport(sensor, eol);
			bool sendOk = sendMail(address, deviceName + " alert", tmpStr);
			if (!sendOk)
			{
#ifdef EVENTS_ENABLE
				eventsFlags[eventNum] = false;
#endif
			}
		}
#endif
		//send_GScript=message
#ifdef GSCRIPT
		else if (gScriptEnable && tmpAction.startsWith(F("send_gscript")))
		{
			tmpAction = tmpAction.substring(tmpAction.indexOf('=') + 1);
			sensor = collectData();
			String tmpStr = deviceName;
			tmpStr += F(": ");
			tmpStr += tmpAction;
			tmpStr += eol;
			tmpStr += ParseSensorReport(sensor, eol);
			bool sendOk = sendValueToGoogle(tmpStr);
			if (!sendOk)
			{
#ifdef EVENTS_ENABLE
				eventsFlags[eventNum] = false;
#endif
			}
		}
#endif
		//save_log
		else if (tmpAction.startsWith(F("save_log")))
		{
			saveLog(sensor);
		}
		else
		{
			Serial.print(F("Incorrect action: \""));
			Serial.print(tmpAction);
			Serial.println(quote);
		}
	} while (action.length() > 0);
}
#endif

String set_output(String outStr)
{
	//Serial.println("SetOut:" + outStr);
	int t = outStr.indexOf('=');
	String str = "";
	if (t >= 11 && t < outStr.length() - 1)
	{
		byte outNum = outStr.substring(10, t).toInt();
		String outStateStr = outStr.substring(t + 1);
		int outState;
		bool pwm_mode = false;
		if (outStateStr == SWITCH_ON) outState = (int)OUT_ON;
		else if (outStateStr == SWITCH_OFF) outState = (int)OUT_OFF;
		else
		{
			pwm_mode = true;
			outState = outStateStr.toInt();
		}
		//Serial.println("SetOut" + String(outNum) + "=" + String(outState));
		const String outTxt = F("Output");
		const String equalTxt = F("=");
#ifdef OUTPUT1_ENABLE
		if (outNum == 1)
		{
			out1 = outState;
			if (pwm_mode) analogWrite(OUTPUT1_ENABLE, outState);
			else digitalWrite(OUTPUT1_ENABLE, out1);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT2_ENABLE
		if (outNum == 2)
		{
			out2 = outState;
			if (pwm_mode) analogWrite(OUTPUT2_ENABLE, outState);
			else digitalWrite(OUTPUT2_ENABLE, out2);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT3_ENABLE
		if (outNum == 3)
		{
			out3 = outState;
			if (pwm_mode) analogWrite(OUTPUT3_ENABLE, outState);
			else digitalWrite(OUTPUT3_ENABLE, out3);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT4_ENABLE
		if (outNum == 4)
		{
			out4 = outState;
			if (pwm_mode) analogWrite(OUTPUT4_ENABLE, outState);
			else digitalWrite(OUTPUT4_ENABLE, out4);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT5_ENABLE
		if (outNum == 5)
		{
			out5 = outState;
			if (pwm_mode) analogWrite(OUTPUT5_ENABLE, outState);
			else digitalWrite(OUTPUT5_ENABLE, out5);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT6_ENABLE
		if (outNum == 6)
		{
			out6 = outState;
			if (pwm_mode) analogWrite(OUTPUT6_ENABLE, outState);
			else digitalWrite(OUTPUT6_ENABLE, out6);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT7_ENABLE
		if (outNum == 7)
		{
			out7 = outState;
			if (pwm_mode) analogWrite(OUTPUT7_ENABLE, outState);
			else digitalWrite(OUTPUT7_ENABLE, out7);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
#ifdef OUTPUT8_ENABLE
		if (outNum == 8)
		{
			out8 = outState;
			if (pwm_mode) analogWrite(OUTPUT8_ENABLE, outState);
			else digitalWrite(OUTPUT8_ENABLE, out8);
			str = outTxt;
			str += String(outNum);
			str += equalTxt;
			str += String((outState));
		}
#endif
		if (str.length() == 0)
		{
			str = F("Incorrect output #");
			str += String(outNum);
			str += eol;
		}
	}
	return str;
}

float getTemperature()
{
	float temp = -1000;
	//sensor = collectData();
#ifdef MH_Z19_UART_ENABLE
	temp = sensor.mh_temp;
#endif

#ifdef DHT_ENABLE
	temp = sensor.dht_temp;
#endif

#ifdef BME280_ENABLE
	temp = sensor.bme280_temp;
#endif

