jekyll2014/ESP8266_IOT_sensor/library/123/ESP8266_IOT_sensor_old.c
#ifdef HTU21D_ENABLE
	temp = sensor.htu21d_temp;
#endif

#ifdef AMS2320_ENABLE
	temp = sensor.ams_temp;
#endif

#ifdef DS18B20_ENABLE
	temp = sensor.ds1820_temp;
#endif
	return temp;
}

float getHumidity()
{
	float humidity = -1000;
	//sensor = collectData();
#ifdef DHT_ENABLE
	humidity = sensor.dht_humidity;
#endif

#ifdef AMS2320_ENABLE
	humidity = round(sensor.ams_humidity);
#endif

#ifdef HTU21D_ENABLE
	humidity = sensor.htu21d_humidity;
#endif

#ifdef BME280_ENABLE
	humidity = sensor.bme280_humidity;
#endif

	return humidity;
}

int getCo2()
{
	int co2_avg = -1000;
	//sensor = collectData();
#if defined(MH_Z19_PPM_ENABLE)
	if (sensor.mh_ppm_co2 > 0)
	{
		co2_ppm_avg[0] = co2_ppm_avg[1];
		co2_ppm_avg[1] = co2_ppm_avg[2];
		co2_ppm_avg[2] = sensor.mh_ppm_co2;
		co2_avg = (co2_ppm_avg[0] + co2_ppm_avg[1] + co2_ppm_avg[2]) / 3;
	}
#endif

#ifdef MH_Z19_UART_ENABLE
	//Serial.println("Avg CO2: " + String(co2_uart_avg[0]) + " / " + String(co2_uart_avg[1]) + " / " + String(co2_uart_avg[2]));
	//Serial.println("New CO2: " + String(sensor.mh_uart_co2));
	if (sensor.mh_uart_co2 > 0)
	{
		co2_uart_avg[0] = co2_uart_avg[1];
		co2_uart_avg[1] = co2_uart_avg[2];
		co2_uart_avg[2] = sensor.mh_uart_co2;
		co2_avg = (co2_uart_avg[0] + co2_uart_avg[1] + co2_uart_avg[2]) / 3;
	}
#endif

	return co2_avg;
}

void saveLog(sensorDataCollection record)
{
	history_log[history_record_number] = record;
	history_record_number++;

	//if log is full - shift data back
	if (history_record_number >= LOG_SIZE)
	{
		history_record_number--;
		for (int i = 0; i < LOG_SIZE - 2; i++)
		{
			history_log[i] = history_log[i + 1];
			yield();
		}
	}
}

#ifdef TELEGRAM_ENABLE
#endif

/*int countOf(String str, char c)
{
	int count = -1;
	for (int i = 0; i < str.length(); i++)
		if (str[i] == c) count++;
	if (count > -1) count++;
	return count;
}*/